In [1]:
import csv
import pandas as pd
import datetime as dt

In [2]:
path = "Chicago_calendar.csv"

In [3]:
df1 = pd.read_csv(path)

In [4]:
df1.head()

   listing_id        date available   price
0      258253  2019-11-14         t  $48.00
1      258253  2019-11-13         t  $48.00
2      258253  2019-11-12         t  $48.00
3      258253  2019-11-11         t  $48.00
4      258253  2019-11-10         t  $48.00

In [5]:
df1 = df1.sort_values(by="date",ascending= True)

In [6]:
df1.head()

         listing_id        date available    price
2771809    29982622  2018-11-15         f      NaN
1836825    24399639  2018-11-15         f      NaN
734435     14529740  2018-11-15         f      NaN
245751      5706620  2018-11-15         t  $150.00
1030645    15495723  2018-11-15         t   $99.00

In [7]:
df1.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [8]:
df2 = df1
timefmt = "%Y-%m-%d" 
df2['date'] = pd.to_datetime(df2['date'], format = timefmt, errors='coerce')

In [9]:
df2.head()

         listing_id       date available    price
2771809    29982622 2018-11-15         f      NaN
1836825    24399639 2018-11-15         f      NaN
734435     14529740 2018-11-15         f      NaN
245751      5706620 2018-11-15         t  $150.00
1030645    15495723 2018-11-15         t   $99.00

In [10]:
today_dt = dt.date.today()
today = dt.datetime.strftime(today_dt, '%Y-%m-%d')

#extract year, month, and day as integers
todayYear = int(dt.datetime.strftime(today_dt, '%Y'))
todayMonth = int(dt.datetime.strftime(today_dt, '%m'))
todayDay = int(dt.datetime.strftime(today_dt, '%d'))


week_later_dt = dt.date(todayYear, todayMonth, todayDay) + dt.timedelta(days=8)
week_later = dt.datetime.strftime(week_later_dt, '%Y-%m-%d')
week_later

'2018-12-27'

In [11]:
df2 = df2.loc[(df2['date']>=today) & (df2['date']<week_later) & (df2['available']=='t'),:]
df2.head()

         listing_id       date available    price
303005      7266347 2018-12-19         t   $40.00
2506314    28805198 2018-12-19         t   $30.00
2634490    29330789 2018-12-19         t  $149.00
2190903    26850565 2018-12-19         t  $115.00
40753        408267 2018-12-19         t   $45.00

In [12]:
df2['price'].value_counts().head()
df2.dtypes

listing_id             int64
date          datetime64[ns]
available             object
price                 object
dtype: object

In [13]:
df2["new_price"] = df2["price"].str.strip('$')

C:\Users\Martin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [14]:
df2["new_price"] = pd.to_numeric(df2["new_price"],errors='coerce')

C:\Users\Martin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [15]:
df2.dtypes

listing_id             int64
date          datetime64[ns]
available             object
price                 object
new_price            float64
dtype: object

In [16]:

bins = [0, 50, 100, 150, 200, 250]

# Create the names for the four bins
group_names = ["Under $50", "$50-100", "$100-150", "$150-200", "$200-250"]

df2["price"] = pd.cut(df2["new_price"], bins, labels=group_names)

C:\Users\Martin\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  import sys

In [17]:
# today_dt
under_50 = []
fifty_100 = []
hundred_150 = []
onefifty_200 = []
twohundred_250 = []

numdays = 8
date_list = [today_dt + dt.timedelta(days=x) for x in range(0, numdays)]

date_list = [dt.datetime.strftime(i, '%Y-%m-%d') for i in date_list]
date_list

for i in date_list:
    prices = df2.loc[df2["date"] == i, "price"].value_counts()
    under_50.append(prices[0])
    fifty_100.append(prices[1])
    hundred_150.append(prices[2])
    onefifty_200.append(prices[3])
    twohundred_250.append(prices[4])

In [22]:
df3 = pd.DataFrame({"Date": date_list, 
                     "Under $50": under_50, 
                     "$50-100": fifty_100, 
                     "$100-150": hundred_150,
                     "$150-200": onefifty_200,
                     "$200-250": twohundred_250
                    })
df3
# df3.set_index("Date")

         Date  Under $50  $50-100  $100-150  $150-200  $200-250
0  2018-12-19       1066     1806       993       418       167
1  2018-12-20       1050     1731       969       430       183
2  2018-12-21        877     1521       877       489       255
3  2018-12-22        819     1359       800       491       270
4  2018-12-23        909     1444       826       459       216
5  2018-12-24        871     1350       735       448       225
6  2018-12-25        869     1334       732       462       221
7  2018-12-26        924     1372       777       441       221